gabaritovr6flexao/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (2 0 0);

boundaryField
{
    top
    {
	type            slip;
    }
    bottom
    {
	type            slip;
    }
    inlet
    {
	type            fixedValue;
	value		uniform (1 0 0);
    }

    outlet
    {
	type            zeroGradient;
    }
    
    front
    {
        type            empty;
    }

  back
    {
        type            empty;
    }

    airfoil
    {
        type            movingWallVelocity;
        value           uniform (0 0 1);
     }

}

// ************************************************************************* //
